[
    {
        "id": 1,
        "estate_title": "Modern Luxury Villa",
        "image": "https://i.ibb.co/ZHfvzvS/modern-residential-district-with-green-roof-balcony-generated-by-ai.jpg",
        "segment_name": "Luxury Villas",
        "description": "Nestled in an exclusive neighborhood, this stunning modern luxury villa redefines opulence and sophistication. Spanning 4,500 sqft, the villa features an open-plan layout, expansive glass walls, and high ceilings that invite natural light to cascade through every corner. The spacious living area flows seamlessly into a gourmet kitchen equipped with top-of-the-line appliances, a large island, and sleek cabinetry. Outside, a private swimming pool is surrounded by a landscaped garden, perfect for entertaining or quiet relaxation. Additional amenities include a home theater, a personal gym, and a spa-like master suite. This property offers unmatched privacy and breathtaking views, making it a dream home for discerning buyers.",
        "price": "$1,200,000",
        "status": "sale",
        "area": "3200 sqft",
        "location": "Beverly Hills, CA",
        "facilities": [
            "Living Room",
            "Swimming Pool",
            "Kitchen",
            "Home Theater",
            "Garden"
        ],
        "ViewProperty": "https://example.com/property/1"
    },
    {
        "id": 2,
        "estate_title": "Cozy Family Home",
        "image": "https://i.ibb.co/n8Rz0ZH/villa-house-model-key-drawing-retro-desktop-real-estate-sale-concept.jpg",
        "segment_name": "Family Homes",
        "description": "This charming family home is located in a quiet suburban community, making it an ideal retreat for families. The house boasts 2,000 sqft of thoughtfully designed space, featuring three bedrooms, two baths, and a bonus room that can be used as a home office or playroom. The open-concept living area includes a warm fireplace and connects seamlessly to a modern kitchen with stainless steel appliances. A spacious backyard with a patio offers the perfect spot for barbecues or gardening. Nearby parks, excellent schools, and friendly neighbors make this home a wonderful place to create lasting memories.",
        "price": "$450,000",
        "status": "sale",
        "area": "1800 sqft",
        "location": "Austin, TX",
        "facilities": [
            "Living Room",
            "Kitchen",
            "Garage",
            "Backyard",
            "Dining Area"
        ],
        "ViewProperty": "https://example.com/property/2"
    },
    {
        "id": 3,
        "estate_title": "Urban Apartment",
        "image": "https://i.ibb.co/h1XK2Z8/denys-nevozhai-Hhm-CIJTLu-GY-unsplash.jpg",
        "segment_name": "Apartments",
        "description": "Escape to serenity in this picturesque seaside cottage, just steps away from pristine sandy beaches. This 1,500 sqft home offers two bedrooms, a sunlit living room with panoramic ocean views, and a fully-equipped kitchen. The cozy interiors are complemented by rustic wooden finishes and large windows that frame the stunning seascape. Outside, the wraparound deck is perfect for watching sunsets, enjoying your morning coffee, or hosting gatherings. Whether you're seeking a permanent residence or a vacation home, this property offers tranquility and a connection to nature like no other.",
        "price": "$2,000/month",
        "status": "rent",
        "area": "1200 sqft",
        "location": "New York City, NY",
        "facilities": [
            "Living Room",
            "Kitchen",
            "Balcony",
            "Gym Access",
            "24/7 Security"
        ],
        "ViewProperty": "https://example.com/property/3"
    },
    {
        "id": 4,
        "estate_title": "Seaside Cottage",
        "image": "https://i.ibb.co/9NwvBhw/scott-webb-1ddol8rg-UH8-unsplash.jpg",
        "segment_name": "Vacation Homes",
        "description": "Experience urban living at its finest in this exquisite penthouse apartment located in the heart of the city. Spanning 2,800 sqft, this property boasts three spacious bedrooms, each with en-suite bathrooms, and a state-of-the-art kitchen with marble countertops. The highlight of the home is the expansive rooftop terrace, complete with a private jacuzzi and sweeping skyline views. The building offers exclusive amenities, including a fitness center, concierge services, and 24/7 security. Ideal for professionals or city enthusiasts, this penthouse combines luxury, convenience, and modern design.",
        "price": "$750,000",
        "status": "sale",
        "area": "1500 sqft",
        "location": "Malibu, CA",
        "facilities": [
            "Living Room",
            "Kitchen",
            "Beach Access",
            "Patio",
            "Fireplace"
        ],
        "ViewProperty": "https://example.com/property/4"
    },
    {
        "id": 5,
        "estate_title": "Penthouse Suite",
        "image": "https://i.ibb.co/5hRGKhr/3d-electric-car-building.jpg",
        "segment_name": "Luxury Apartments",
        "description": "Embrace sustainability with this eco-friendly house designed for green living. Built with environmentally-conscious materials, this 2,200 sqft home features solar panels, energy-efficient windows, and a rainwater harvesting system. The interior includes three bedrooms, two bathrooms, and an open-plan kitchen with recycled wood finishes. A lush garden with native plants and an organic vegetable patch completes the property. Located in a community that values environmental preservation, this home offers the perfect blend of comfort and sustainability for eco-conscious residents.",
        "price": "$10,000/month",
        "status": "rent",
        "area": "2500 sqft",
        "location": "Miami, FL",
        "facilities": [
            "Living Room",
            "Swimming Pool",
            "Kitchen",
            "Rooftop Deck",
            "Gym Access"
        ],
        "ViewProperty": "https://example.com/property/5"
    },
    {
        "id": 6,
        "estate_title": "Suburban Retreat",
        "image": "https://i.ibb.co/CWQD0Yv/evelyn-paris-XJn-P4-L958ds-unsplash.jpg",
        "segment_name": "Family Homes",
        "description": "Escape to the mountains with this cozy yet luxurious retreat cabin. This 1,800 sqft property features a rustic aesthetic with exposed wooden beams, stone accents, and a fireplace that serves as the heart of the living area. The cabin includes two bedrooms, a loft area, and a fully-equipped kitchen. The large deck offers panoramic views of the surrounding forest and is an ideal spot for stargazing or enjoying fresh mountain air. With hiking trails, ski resorts, and tranquil surroundings, this property is perfect for nature lovers and adventure enthusiasts alike.",
        "price": "$600,000",
        "status": "sale",
        "area": "2000 sqft",
        "location": "Denver, CO",
        "facilities": [
            "Living Room",
            "Kitchen",
            "Garage",
            "Backyard",
            "Home Office"
        ],
        "ViewProperty": "https://example.com/property/6"
    },
    {
        "id": 7,
        "estate_title": "Mountain Cabin",
        "image": "https://i.ibb.co/wz10Wf3/nathan-walker-Sv4btqhc-Yqw-unsplash.jpg",
        "segment_name": "Vacation Homes",
        "description": "Discover comfort and convenience in this stunning suburban retreat located just minutes from the city center. The 2,500 sqft property offers four bedrooms, three baths, and a spacious family room that opens to a modern kitchen with granite countertops. A private backyard with a swimming pool and patio makes outdoor entertaining a delight. The home is part of a family-friendly neighborhood with excellent schools, parks, and recreational facilities. Perfect for growing families, this property offers a harmonious balance of space, style, and location.",
        "price": "$400,000",
        "status": "sale",
        "area": "1400 sqft",
        "location": "Aspen, CO",
        "facilities": [
            "Living Room",
            "Fireplace",
            "Kitchen",
            "Patio",
            "Storage"
        ],
        "ViewProperty": "https://example.com/property/7"
    },
    {
        "id": 8,
        "estate_title": "Eco-Friendly House",
        "image": "https://i.ibb.co/kQ1Fv23/jessica-furtney-YOouc-EImr-Kw-unsplash.jpg",
        "segment_name": "Eco Homes",
        "description": "Wake up to the sound of waves in this luxurious beachfront villa, offering direct access to pristine shores. Spread across 3,200 sqft, the villa features four bedrooms, an expansive living area with floor-to-ceiling windows, and a chef’s kitchen with high-end appliances. The outdoor area boasts a private infinity pool, a sun deck, and lush tropical landscaping. Perfect for those who love coastal living, this villa provides a seamless blend of luxury and natural beauty, making it ideal for vacationers or year-round residents.",
        "price": "$700,000",
        "status": "sale",
        "area": "2200 sqft",
        "location": "Portland, OR",
        "facilities": [
            "Living Room",
            "Kitchen",
            "Solar Panels",
            "Garden",
            "Home Office"
        ],
        "ViewProperty": "https://example.com/property/8"
    },
    {
        "id": 9,
        "estate_title": "City Studio Apartment",
        "image": "https://i.ibb.co/k3pw12b/travel-cents-WYLu-NY5-JG4-E-unsplash.jpg",
        "segment_name": "Compact Apartments",
        "description": "Designed for modern urban living, this compact city studio is a perfect blend of functionality and style. With 600 sqft of space, the apartment features a sleek open-concept layout, a fully-equipped kitchenette, and a foldable bed that maximizes living space. Floor-to-ceiling windows bring in ample natural light, and a small balcony offers views of the bustling city below. Located in a building with a gym, co-working spaces, and a rooftop lounge, this studio is perfect for singles or young professionals looking for a vibrant city lifestyle.",
        "price": "$1,500/month",
        "status": "rent",
        "area": "600 sqft",
        "location": "San Francisco, CA",
        "facilities": [
            "Living Room",
            "Kitchen",
            "Gym Access",
            "Parking",
            "Laundry"
        ],
        "ViewProperty": "https://example.com/property/9"
    }
]